apache/nuttx/arch/arm/src/lpc54xx/lpc54_ethernet.c
#define LPC54_BUFFER_SIZE       MAX_NETDEV_PKTSIZE
#define LPC54_BUFFER_ALLOC      ((MAX_NETDEV_PKTSIZE + CONFIG_NET_GUARDSIZE + 3) & ~3)
#define LPC54_BUFFER_WORDS      ((MAX_NETDEV_PKTSIZE + CONFIG_NET_GUARDSIZE + 3) >> 2)
#define LPC54_BUFFER_MAX        16384

/* DMA and DMA descriptor definitions */

#define LPC54_MIN_RINGLEN       4     /* Min length of a ring */
#define LPC54_MAX_RINGLEN       1023  /* Max length of a ring */
#define LPC54_MAX_RINGS         2     /* Max number of tx/rx descriptor rings */
#ifdef CONFIG_LPC54_ETH_MULTIQUEUE
#  define LPC54_NRINGS          2     /* Use 2 Rx and Tx rings */
#else
#  define LPC54_NRINGS          1     /* Use 1 Rx and 1 Tx ring */
#endif

#ifndef CONFIG_LPC54_ETH_BURSTLEN
#  define CONFIG_LPC54_ETH_BURSTLEN 1
#endif

#if CONFIG_LPC54_ETH_BURSTLEN < 2
#  define LPC54_BURSTLEN        1
#  define LPC54_PBLX8           0
#elif CONFIG_LPC54_ETH_BURSTLEN < 4
#  define LPC54_BURSTLEN        2
#  define LPC54_PBLX8           0
#elif CONFIG_LPC54_ETH_BURSTLEN < 8
#  define LPC54_BURSTLEN        4
#  define LPC54_PBLX8           0
#elif CONFIG_LPC54_ETH_BURSTLEN < 16
#  define LPC54_BURSTLEN        8
#  define LPC54_PBLX8           0
#elif CONFIG_LPC54_ETH_BURSTLEN < 32
#  define LPC54_BURSTLEN        16
#  define LPC54_PBLX8           0
#elif CONFIG_LPC54_ETH_BURSTLEN < 64
#  define LPC54_BURSTLEN        32
#  define LPC54_PBLX8           0
#elif CONFIG_LPC54_ETH_BURSTLEN < 128
#  define LPC54_BURSTLEN        8
#  define LPC54_PBLX8           ETH_DMACH_CTRL_PBLx8
#elif CONFIG_LPC54_ETH_BURSTLEN < 256
#  define LPC54_BURSTLEN        16
#  define LPC54_PBLX8           ETH_DMACH_CTRL_PBLx8
#else
#  define LPC54_BURSTLEN        32
#  define LPC54_PBLX8           ETH_DMACH_CTRL_PBLx8
#endif

#ifdef CONFIG_LPC54_ETH_DYNAMICMAP
#  define LPC54_QUEUEMAP        (ETH_MTL_RXQ_DMA_MAP_Q0DDMACH | \
                                 ETH_MTL_RXQ_DMA_MAP_Q1DDMACH)
#else
#  define LPC54_QUEUEMAP        ETH_MTL_RXQ_DMA_MAP_Q1MDMACH
#endif

/* Interrupt masks */

#define LPC54_ABNORM_INTMASK    (ETH_DMACH_INT_TS  | ETH_DMACH_INT_RBU | \
                                 ETH_DMACH_INT_RS  | ETH_DMACH_INT_RWT | \
                                 ETH_DMACH_INT_FBE | ETH_DMACH_INT_AI)
#define LPC54_TXERR_INTMASK     (ETH_DMACH_INT_TS)
#define LPC54_RXERR_INTMASK     (ETH_DMACH_INT_RBU | ETH_DMACH_INT_RS  | \
                                 ETH_DMACH_INT_RWT)
#define LPC54_NORM_INTMASK      (ETH_DMACH_INT_TI  | ETH_DMACH_INT_RI  | \
                                 ETH_DMACH_INT_NI)

/* This is a helper pointer for accessing the contents of the Ethernet
 * header.
 */

#define ETH8021QWBUF ((struct eth_8021qhdr_s *)priv->eth_dev.d_buf)

/* This is a helper pointer for accessing the contents of the Ethernet
 * header
 */

#define BUF ((struct eth_hdr_s *)&dev->d_buf[0])

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Describes the state of one Tx descriptor ring */

struct lpc54_txring_s
{
  struct enet_txdesc_s *tr_desc; /* Tx descriptor base address */
  uint16_t tr_supply;            /* Tx supplier ring index */
  uint16_t tr_consume;           /* Tx consumer ring index */
  uint16_t tr_ndesc;             /* Number or descriptors in the Tx ring */
  uint16_t tr_inuse;             /* Number of Tx descriptors in-use */
  uint32_t **tr_buffers;         /* Packet buffers assigned to the Rx ring */
};

/* Describes the state of one Rx descriptor ring */

struct lpc54_rxring_s
{
  struct enet_rxdesc_s *rr_desc; /* Rx descriptor base address */
  uint16_t rr_supply;            /* Available Rx descriptor ring index */
  uint16_t rr_ndesc;             /* Number or descriptors in the Rx ring */
  uint32_t **rr_buffers;         /* Packet buffers assigned to the Rx ring */
};

/* The lpc54_ethdriver_s encapsulates all state information for a single
 * Ethernet interface
 */

struct lpc54_ethdriver_s
{
  uint8_t eth_bifup : 1;         /* 1:ifup 0:ifdown */
  uint8_t eth_fullduplex : 1;    /* 1:Full duplex 0:Half duplex mode */
  uint8_t eth_100mbps : 1;       /* 1:100mbps 0:10mbps */
  uint8_t eth_rxdiscard : 1;     /* 1:Discarding Rx data */
  struct wdog_s eth_txtimeout;   /* TX timeout timer */
  struct work_s eth_irqwork;     /* For deferring interrupt work to the work queue */
  struct work_s eth_pollwork;    /* For deferring poll work to the work queue */
  struct work_s eth_timeoutwork; /* For deferring timeout work to the work queue */
  struct sq_queue_s eth_freebuf; /* Free packet buffers */

  /* Ring state */

  struct lpc54_txring_s eth_txring[LPC54_NRINGS];
  struct lpc54_rxring_s eth_rxring[LPC54_NRINGS];

  /* This holds the information visible to the NuttX network */

  struct net_driver_s eth_dev;   /* Interface understood by the network */
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* These statically allocated structures are possible because only a single
 * instance of the Ethernet device could be supported.  In order to support
 * multiple devices instances, this data would have to be allocated
 * dynamically.
 */

/* Driver state structure */

static struct lpc54_ethdriver_s g_ethdriver;

/* Rx DMA descriptors */

static struct enet_rxdesc_s g_ch0_rxdesc[CONFIG_LPC54_ETH_NRXDESC0];
#ifdef CONFIG_LPC54_ETH_MULTIQUEUE
static struct enet_rxdesc_s g_ch1_rxdesc[CONFIG_LPC54_ETH_NRXDESC1];
#endif

/* Tx DMA descriptors */

static struct enet_txdesc_s g_ch0_txdesc[CONFIG_LPC54_ETH_NTXDESC0];
#ifdef CONFIG_LPC54_ETH_MULTIQUEUE
static struct enet_txdesc_s g_ch1_txdesc[CONFIG_LPC54_ETH_NTXDESC1];
#endif

/* Preallocated packet buffers */

static uint32_t g_prealloc_buffers[LPC54_NBUFFERS * LPC54_BUFFER_WORDS];

/* Packet buffers assigned to Rx and Tx descriptors.  The packet buffer
 * addresses are lost in the DMA due to write-back from the DMA hardware.
 * So we have to remember the buffer assignments explicitly.
 *
 * REVISIT:  According to the User manual, buffer1 and buffer2 addresses
 * will be overwritten by DMA write-back data.  However, I see that the
 * Rx buffer1 and buffer2 addresses are, indeed, used by the NXP example
 * code after completion of DMA so the user manual must be wrong.  We
 * could eliminate this extra array of saved allocation addresses.
 */

