apache/nuttx/arch/arm/src/lpc54xx/lpc54_ethernet.c
static int lpc54_eth_transmit(struct lpc54_ethdriver_s *priv,
                              unsigned int chan)
{
  struct lpc54_txring_s *txring;
  struct enet_txdesc_s *txdesc;
  uint8_t *buffer;
  uint32_t regval;
  unsigned int buflen;

  /* Verify that the hardware is ready to send another packet.  If we get
   * here, then we are committed to sending a packet; Higher level logic
   * must have assured that we have the resources available to perform the
   * send.
   */

  txring = &priv->eth_txring[chan];

  DEBUGASSERT(priv->eth_dev.d_buf != 0 && priv->eth_dev.d_len > 0 &&
              priv->eth_dev.d_len <= LPC54_BUFFER_SIZE &&
              txring->tr_inuse < txring->tr_ndesc);

  /* Fill the descriptor. */

  txdesc = txring->tr_desc + txring->tr_supply;
  buffer = priv->eth_dev.d_buf;
  buflen = priv->eth_dev.d_len;

  priv->eth_dev.d_buf = NULL;
  priv->eth_dev.d_len = 0;

  if (buflen <= LPC54_BUFFER_MAX)
    {
      /* Prepare the Tx descriptor for transmission */

      txdesc->buffer1 = (uint32_t)buffer;
      txdesc->buffer2 = 0;

      /* One buffer, no timestamp, interrupt on completion */

      regval = ETH_TXDES2_B1L(buflen) | ETH_TXDES2_B2L(0) | ETH_TXDES2_IOC;
      txdesc->buflen = regval;

      /* Full packet length, last descriptor, first descriptor, owned by
       * DMA.
       */

      regval = ETH_TXDES3_FL(buflen) | ETH_TXDES3_LD | ETH_TXDES3_FD |
               ETH_TXDES3_OWN;
      txdesc->ctrlstat = regval;
    }
#if LPC54_BUFFER_SIZE > LPC54_BUFFER_MAX
  else
    {
      unsigned int buf2len = buflen - LPC54_BUFFER_MAX;
      uint8_t *buffer2     = buffer + LPC54_BUFFER_MAX;

      DEBUGASSERT(buf2len <= LPC54_BUFFER_MAX);

      /* Prepare the Tx descriptor for transmission */

      txdesc->buffer1 = (uint32_t)buffer;
      txdesc->buffer2 = (uint32_t)buffer2;

      /* Two buffers, no timestamp, interrupt on completion */

      regval = ETH_TXDES2_B1L(LPC54_BUFFER_MAX) |
               ETH_TXDES2_B2L(buf2len) | ETH_TXDES2_IOC;
      txdesc->buflen = regval;

      /* Full packet length, last descriptor, first descriptor, owned by
       * DMA.
       */

      regval = ETH_TXDES3_FL(buflen) | ETH_TXDES3_LD | ETH_TXDES3_FD |
               ETH_TXDES3_OWN;
      txdesc->ctrlstat = regval;
    }
#endif

  /* Increase the index */

  if (++(txring->tr_supply) >= txring->tr_ndesc)
    {
      txring->tr_supply = 0;
    }

  /* Increment the number of descriptors in-use. */

  txring->tr_inuse++;

  /* Update the transmit tail address. */

  txdesc = txring->tr_desc + txring->tr_supply;
  if (txring->tr_supply == 0)
    {
      txdesc = txring->tr_desc + txring->tr_ndesc;
    }

  /* Update the DMA tail pointer */

  lpc54_putreg((uint32_t)txdesc, LPC54_ETH_DMACH_TXDESC_TAIL_PTR(chan));

  /* Setup the TX timeout watchdog (perhaps restarting the timer) */

  wd_start(&priv->eth_txtimeout, LPC54_TXTIMEOUT,
           lpc54_eth_txtimeout_expiry, (wdparm_t)priv);
  return OK;
}

/****************************************************************************
 * Name: lpc54_eth_getring
 *
 * Description:
 *   An output message is ready to send, but which queue should we send it
 *   on?  The rule is this:
 *
 *   "Normal" packets (or CONFIG_LPC54_ETH_MULTIQUEUE not selected):
 *     Always send on ring 0
 *   8021QVLAN AVB packets (and CONFIG_LPC54_ETH_MULTIQUEUE not selected):
 *     Always send on ring 1
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *
 * Returned Value:
 *   The ring to use when sending the packet.
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static unsigned int lpc54_eth_getring(struct lpc54_ethdriver_s *priv)
{
  unsigned int ring = 0;

#ifdef CONFIG_LPC54_ETH_MULTIQUEUE
  /* Choose the ring ID for different types of frames.  For 802.1q VLAN AVB
   * frames, uses ring 1.  Everything else goes on ring 0.
   */

  if (ETH8021QWBUF->tpid == HTONS(TPID_8021QVLAN) &&
      ETH8021QWBUF->type == HTONS(ETHTYPE_AVBTP))
    {
      ring = 1;
    }
#endif

  return ring;
}

/****************************************************************************
 * Name: lpc54_eth_txpoll
 *
 * Description:
 *   The transmitter is available, check if the network has any outgoing
 *   packets ready to send.  This is a callback from devif_poll().
 *   devif_poll() may be called:
 *
 *   1. When the preceding TX packet send is complete,
 *   2. When the preceding TX packet send timesout and the interface is reset
 *   3. During normal TX polling
 *
 * Input Parameters:
 *   dev - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static int lpc54_eth_txpoll(struct net_driver_s *dev)
{
  struct lpc54_ethdriver_s *priv;
  struct lpc54_txring_s *txring;
  struct lpc54_txring_s *txring0;
#ifdef CONFIG_LPC54_ETH_MULTIQUEUE
  struct lpc54_txring_s *txring1;
#endif
  unsigned int chan;

  DEBUGASSERT(dev->d_private != NULL && dev->d_buf != NULL);
  priv = (struct lpc54_ethdriver_s *)dev->d_private;

  /* Send the packet */

  chan   = lpc54_eth_getring(priv);
  txring = &priv->eth_txring[chan];

  (txring->tr_buffers)[txring->tr_supply] =
    (uint32_t *)priv->eth_dev.d_buf;

  lpc54_eth_transmit(priv, chan);

  txring0 = &priv->eth_txring[0];
#ifdef CONFIG_LPC54_ETH_MULTIQUEUE
  txring1 = &priv->eth_txring[1];

  /* We cannot perform the Tx poll now if all of the Tx descriptors
   * for both channels are in-use.
   */

  if (txring0->tr_inuse >= txring0->tr_ndesc ||
      txring1->tr_inuse >= txring1->tr_ndesc)
#else
  /* We cannot continue the Tx poll now if all of the Tx descriptors
   * for this channel 0 are in-use.
   */

  if (txring0->tr_inuse >= txring0->tr_ndesc)
#endif
    {
      /* Stop the poll.. no more Tx descriptors */

      return 1;
    }

  /* There is a free descriptor in the ring, allocate a new Tx buffer
   * to perform the poll.
   */

  priv->eth_dev.d_buf = (uint8_t *)lpc54_pktbuf_alloc(priv);
  if (priv->eth_dev.d_buf == NULL)
    {
      /* Stop the poll.. no more packet buffers */

      return 1;
    }

  /* If zero is returned, the polling will continue until all connections
   * have been examined.  If there is nothing to be sent, we will return to
   * the caller of devif_poll() with an allocated packet buffer.
   */

