apache/nuttx/arch/arm/src/lpc54xx/lpc54_ethernet.c
  return 0;
}

/****************************************************************************
 * Name: lpc54_eth_reply
 *
 * Description:
 *   After a packet has been received and dispatched to the network, it
 *   may return return with an outgoing packet.  This function checks for
 *   that case and performs the transmission if necessary.
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static void lpc54_eth_reply(struct lpc54_ethdriver_s *priv)
{
  struct lpc54_txring_s *txring;
  unsigned int chan;

  /* If the packet dispatch resulted in data that should be sent out on the
   * network, the field d_len will set to a value > 0.
   */

  if (priv->eth_dev.d_len > 0)
    {
      /* Update the Ethernet header with the correct MAC address */

#ifdef CONFIG_LPC54_ETH_MULTIQUEUE
      /* Check for an outgoing 802.1q VLAN packet */
#warning Missing Logic
#endif

      /* And send the packet */

      chan   = lpc54_eth_getring(priv);
      txring = &priv->eth_txring[chan];

      (txring->tr_buffers)[txring->tr_supply] =
        (uint32_t *)priv->eth_dev.d_buf;

      lpc54_eth_transmit(priv, chan);
    }
}

/****************************************************************************
 * Name: lpc54_eth_rxdispatch
 *
 * Description:
 *   A new packet has been received and will be forwarded to the network
 *   stack.
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static void lpc54_eth_rxdispatch(struct lpc54_ethdriver_s *priv)
{
  struct net_driver_s *dev = &priv->eth_dev;

#ifdef CONFIG_NET_PKT
  /* When packet sockets are enabled, feed the frame into the tap */

  pkt_input(dev);
#endif

  /* We only accept IP packets of the configured type and ARP packets */

#ifdef CONFIG_NET_IPv4
  if (BUF->type == HTONS(ETHTYPE_IP))
    {
      ninfo("IPv4 packet\n");
      NETDEV_RXIPV4(dev);

      /* Receive an IPv4 packet from the network device */

      ipv4_input(dev);

      /* Check for a reply to the IPv4 packet */

      lpc54_eth_reply(priv);
    }
  else
#endif
#ifdef CONFIG_NET_IPv6
  if (BUF->type == HTONS(ETHTYPE_IP6))
    {
      ninfo("IPv6 packet\n");
      NETDEV_RXIPV6(dev);

      /* Dispatch IPv6 packet to the network layer */

      ipv6_input(dev);

      /* Check for a reply to the IPv6 packet */

      lpc54_eth_reply(priv);
    }
  else
#endif
#ifdef CONFIG_LPC54_ETH_MULTIQUEUE
  if (ETH8021QWBUF->tpid == HTONS(TPID_8021QVLAN))
    {
      ninfo("IEEE 802.1q packet\n");
      NETDEV_RXQVLAN(dev);

      /* Dispatch the 802.1q VLAN packet to the network layer */

      qvlan_input(dev);

      /* Check for a reply to the 802.1q VLAN packet */

      lpc54_eth_reply(priv);
    }
  else
#endif
#ifdef CONFIG_NET_ARP
  if (BUF->type == HTONS(ETHTYPE_ARP))
    {
      struct lpc54_txring_s *txring;
      unsigned int chan;

      /* Dispatch the ARP packet to the network layer */

      arp_input(dev);
      NETDEV_RXARP(dev);

      /* If the above function invocation resulted in data that should be
       * sent out on the network, d_len field will set to a value > 0.
       */

      if (dev->d_len > 0)
        {
          chan   = lpc54_eth_getring(priv);
          txring = &priv->eth_txring[chan];

          (txring->tr_buffers)[txring->tr_supply] =
            (uint32_t *)dev->d_buf;

          lpc54_eth_transmit(priv, chan);
        }
    }
  else
#endif
    {
      NETDEV_RXDROPPED(dev);
    }

  /* On entry, d_buf refers to the receive buffer as set by logic in
   * lpc54_eth_receive().  If lpc54_eth_transmit() was called to reply
   * with an outgoing packet, then that packet was removed for transmission
   * and d_buf was nullified.  Otherwise, d_buf still holds the stale
   * receive buffer and we will need to dispose of it here.
   */

  if (dev->d_buf != NULL)
    {
      lpc54_pktbuf_free(priv, (uint32_t *)dev->d_buf);
    }

  dev->d_buf = NULL;
  dev->d_len = 0;
}

/****************************************************************************
 * Name: lpc54_eth_receive
 *
 * Description:
 *   An interrupt was received indicating the availability of a new RX packet
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *   chan - The channel with the completed Rx transfer
 *
 * Returned Value:
 *   The number of Rx descriptors processed
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static int lpc54_eth_receive(struct lpc54_ethdriver_s *priv,
                              unsigned int chan)
{
  struct lpc54_rxring_s *rxring;
  struct enet_rxdesc_s *rxdesc;
  unsigned int framelen;
  unsigned int pktlen;
  unsigned int supply;
  uint32_t regval;
  bool suspend;
  int ndesc;

  /* Get the Rx ring associated with this channel */

  rxring  = &priv->eth_rxring[chan];

  /* If no Rx descriptor is available, then suspend for now */

  regval  = lpc54_getreg(LPC54_ETH_DMACH_STAT(chan));
  suspend = ((regval & ETH_DMACH_INT_RBU) != 0);

  /* Loop until the next full frame is encountered or until we encounter a
   * descriptor still owned by the DMA.
   */

  pktlen = 0;
  ndesc  = 0;

  for (; ; )
    {
      /* Get the last Rx descriptor in the ring */

      supply = rxring->rr_supply;
      rxdesc = rxring->rr_desc + supply;

      /* Is this frame still owned by the DMA? */

      if ((rxdesc->ctrl & ETH_RXDES3_OWN) != 0)
        {
          /* Yes.. then bail */

          return ndesc;
        }

      ndesc++;

      /* Set the supplier index to the next descriptor */

      if (++(rxring->rr_supply) > rxring->rr_ndesc)
        {
          rxring->rr_supply = 0;
        }

      /* Is this the last descriptor of the frame? */

      if ((rxdesc->ctrl & ETH_RXDES3_LD) != 0)
        {
          /* Have we been discarding Rx data?  If so, that was the last
           * packet to be discarded.
           */

