apache/nuttx/arch/arm/src/lpc54xx/lpc54_ethernet.c
          if (priv->eth_rxdiscard)
            {
              priv->eth_rxdiscard = 0;
            }
          else
            {
              /* Last frame encountered.  This is a valid packet */

              framelen  = (rxdesc->ctrl & ETH_RXDES3_PL_MASK);
              pktlen   += framelen;

              if (pktlen > 0)
                {
                  /* Recover the buffer.
                   *
                   * REVISIT:  According to the User manual, buffer1 and
                   * buffer2 addresses were overwritten by the write-back
                   * data.  However, I see that the buffer1 and buffer2
                   * addresses are, indeed, used by the NXP example code
                   * so the user manual must be wrong.  We could eliminate
                   * this extra array of saved allocation addresses.
                   */

                  priv->eth_dev.d_buf = (uint8_t *)
                    (rxring->rr_buffers)[supply];
                  (rxring->rr_buffers)[supply] = NULL;
                  DEBUGASSERT(priv->eth_dev.d_buf != NULL);

                  priv->eth_dev.d_len = pktlen;

                  /* REVISIT: What should we do if there is no Tx buffer
                   * available.  In receiving the packet, we could also
                   * generate a new outgoing packet that could only be
                   * handled if there is an available Tx descriptor.
                   */

                  lpc54_eth_rxdispatch(priv);

                  /* Allocate a new Rx buffer and update the Rx buffer
                   * descriptor.
                   */

                  rxdesc->buffer1 = (uint32_t)lpc54_pktbuf_alloc(priv);
                  DEBUGASSERT(rxdesc->buffer1 != 0);
                  (rxring->rr_buffers)[supply] = (uint32_t *)rxdesc->buffer1;

#if LPC54_BUFFER_SIZE > LPC54_BUFFER_MAX
                  rxdesc->buffer2 = rxdesc->buffer1 + LPC54_BUFFER_MAX;
#else
                  /* The second buffer is not used */

                  rxdesc->buffer2  = 0;
#endif
                  rxdesc->reserved = 0;

                  /* Buffer1 (and maybe 2) valid, interrupt on completion,
                   * owned by DMA.
                   */

                  regval  = ETH_RXDES3_BUF1V | ETH_RXDES3_IOC |
                            ETH_RXDES3_OWN;
#if LPC54_BUFFER_SIZE > LPC54_BUFFER_MAX
                  regval |= ETH_RXDES3_BUF2V;
#endif
                  rxdesc->ctrl = regval;
                }

              return ndesc;
            }
        }
      else if (!priv->eth_rxdiscard)
        {
          /* Not the last Rx descriptor of the packet.
           *
           * We are attempting to receive a large packet spanning multiple
           * Rx descriptors.  We cannot support that in this design.  We
           * would like to:
           *
           *   1. Accumulate the data in yet another Rx buffer,
           *   2. Accumulate the size in the 'pktlen' local variable, then
           *   3. Dispatch that extra Rx buffer when the last frame is
           *      encountered.
           *
           * The assumption here is that this will never happen if our MTU
           * properly advertised.
           */

          NETDEV_RXDROPPED(&priv->eth_dev);
          priv->eth_rxdiscard = 1;
        }
    }

  /* Restart the receiver and clear the RBU status if it was suspended. */

  if (suspend)
    {
      uintptr_t regaddr = LPC54_ETH_DMACH_RXDESC_TAIL_PTR(chan);

      /* Clear the RBU status */

      lpc54_putreg(ETH_DMACH_INT_RBU, LPC54_ETH_DMACH_STAT(chan));

      /* Writing to the tail pointer register
       * will restart the Rx processing
       */

      regval = lpc54_getreg(regaddr);
      lpc54_putreg(regval, regaddr);
    }

  return ndesc;
}

/****************************************************************************
 * Name: lpc54_eth_txdone
 *
 * Description:
 *   An interrupt was received indicating that the last TX packet(s) is done
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *   chan - The channel with the completed Tx transfer
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static void lpc54_eth_txdone(struct lpc54_ethdriver_s *priv,
                             unsigned int chan)
{
  struct lpc54_txring_s *txring;
#ifdef CONFIG_LPC54_ETH_MULTIQUEUE
  struct lpc54_txring_s *txring0;
  struct lpc54_txring_s *txring1;
#endif
  struct enet_txdesc_s *txdesc;
  uint32_t *pktbuf;

  /* Reclaim the compled Tx descriptor */

  txring = &priv->eth_txring[chan];
  txdesc = txring->tr_desc + txring->tr_consume;

  /* Update the first index for transmit buffer free. */

  while (txring->tr_inuse > 0 && (txdesc->ctrlstat & ETH_TXDES3_OWN) == 0)
    {
      /* Update statistics */

      NETDEV_TXDONE(&priv->eth_dev);

      /* Free the Tx buffer assigned to the descriptor */

      pktbuf = txring->tr_buffers[txring->tr_consume];
      DEBUGASSERT(pktbuf != NULL);
      if (pktbuf != NULL)
        {
          lpc54_pktbuf_free(priv, pktbuf);
          txring->tr_buffers[txring->tr_consume] = NULL;
        }

      /* One less Tx descriptor in use */

      txring->tr_inuse--;

      /* Update the consume index and the descriptor pointer. */

      if (++(txring->tr_consume) >= txring->tr_ndesc)
        {
          txring->tr_consume = 0;
        }

      txdesc = txring->tr_desc + txring->tr_consume;
    }

  /* If no further transmissions are pending, then cancel the TX timeout. */

#ifdef CONFIG_LPC54_ETH_MULTIQUEUE
  txring0 = &priv->eth_txring[0];
  txring1 = &priv->eth_txring[1];

  if (txring0->tr_inuse == 0 && txring1->tr_inuse == 0)

#else
  if (txring->tr_inuse == 0)
#endif
    {
      wd_cancel(&priv->eth_txtimeout);
      work_cancel(ETHWORK, &priv->eth_timeoutwork);
    }

  /* Poll the network for new TX data. */

  lpc54_eth_dopoll(priv);
}

/****************************************************************************
 * Name: lpc54_eth_channel_work
 *
 * Description:
 *   Perform interrupt related work for a channel DMA interrupt
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *   chan - The channel that received the interrupt event.
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static void lpc54_eth_channel_work(struct lpc54_ethdriver_s *priv,
                                   unsigned int chan)
{
  uintptr_t regaddr;
  uint32_t status;
  uint32_t pending;

