apache/nuttx/arch/arm/src/lpc54xx/lpc54_ethernet.c
  /* Read the DMA status register for this channel */

  regaddr = LPC54_ETH_DMACH_STAT(chan);
  status  = lpc54_getreg(regaddr);
  pending = status & lpc54_getreg(LPC54_ETH_DMACH_INT_EN(chan));

  /* Check for abnormal interrupts */

  if ((pending & LPC54_ABNORM_INTMASK) != 0)
    {
      /* Acknowledge the abnormal interrupt interrupts except for RBU...
       * that is a special case where the status will be cleared in
       * lpc54_eth_receive().  See comments below.
       */

      lpc54_putreg((LPC54_ABNORM_INTMASK & ~ETH_DMACH_INT_RBU), regaddr);

      /* Handle the incoming packet */

      nerr("ERROR: Abnormal interrupt received: %08lx (%08lx)\n",
           (unsigned long)pending, (unsigned long)status);

      /* Check for Tx/Rx related errors and update statistics */

      if ((pending & LPC54_RXERR_INTMASK) != 0)
        {
          NETDEV_RXERRORS(&priv->eth_dev);
        }

      if ((pending & LPC54_TXERR_INTMASK) != 0)
        {
          NETDEV_TXERRORS(&priv->eth_dev);
        }

      /* The Receive Buffer Unavailable (RBU) error is a special case.  It
       * means that we have an Rx overrun condition:  All of the Rx buffers
       * have been filled with packet data and there are no Rx descriptors
       * available to receive the next packet.
       *
       * Often RBU is accompanied by RI but we need to force that condition
       * in all cases.  In the case of RBU, we need to perform receive
       * processing in order to recover from the situation and to resume.
       *
       * This is really a configuration problem:  It really means that we
       * have not assigned enough Rx buffers for the environment and
       * addressing filtering options that we have selected.
       */

      if ((pending & ETH_DMACH_INT_RBU) != 0)
        {
          pending |= ETH_DMACH_INT_RI;
        }

      pending &= ~LPC54_ABNORM_INTMASK;
    }

  /* Check for a receive interrupt */

  if ((pending & ETH_DMACH_INT_RI) != 0)
    {
      int ndesc;

      /* Acknowledge the normal receive interrupt */

      lpc54_putreg(ETH_DMACH_INT_RI | ETH_DMACH_INT_NI, regaddr);
      pending &= ~(ETH_DMACH_INT_RI | ETH_DMACH_INT_NI);

      /* Loop until all available Rx packets
       * in the ring have been processed
       */

      for (; ; )
        {
          /* Dispatch the next packet from the Rx ring */

          ndesc = lpc54_eth_receive(priv, chan);
          if (ndesc > 0)
            {
              /* Update statistics if a packet was dispatched */

              NETDEV_RXPACKETS(&priv->eth_dev);
            }
          else
            {
              break;
            }
        }
    }

  /* Check for a transmit interrupt */

  if ((pending & ETH_DMACH_INT_TI) != 0)
    {
      /* Acknowledge the normal receive interrupt */

      lpc54_putreg(ETH_DMACH_INT_TI | ETH_DMACH_INT_NI, regaddr);
      pending &= ~(ETH_DMACH_INT_TI | ETH_DMACH_INT_NI);

      /* Handle the Tx completion event.  Reclaim the completed Tx
       * descriptors, free packet buffers, and check if we can start a new
       * transmission.
       */

      lpc54_eth_txdone(priv, chan);
    }

  /* Check for unhandled interrupts (shouldn't be any) */

  if (pending != 0)
    {
      nwarn("WARNING: Unhandled interrupts: %08lx (%08lx)\n",
           (unsigned long)pending, (unsigned long)status);
      lpc54_putreg(pending, regaddr);
    }
}

/****************************************************************************
 * Name: lpc54_eth_interrupt_work
 *
 * Description:
 *   Perform interrupt related work from the worker thread
 *
 * Input Parameters:
 *   arg - The argument passed when work_queue() was called.
 *
 * Returned Value:
 *   OK on success
 *
 * Assumptions:
 *   Runs on a worker thread.
 *
 ****************************************************************************/

static void lpc54_eth_interrupt_work(void *arg)
{
  struct lpc54_ethdriver_s *priv = (struct lpc54_ethdriver_s *)arg;
  uint32_t intrstat;

  /* Lock the network to serialize driver operations. */

  net_lock();

  /* Check if interrupt is from DMA channel 0. */

  intrstat = lpc54_getreg(LPC54_ETH_DMA_INTR_STAT);
  if ((intrstat & ETH_DMA_INTR_STAT_DC0IS) != 0)
    {
      lpc54_eth_channel_work(priv, 0);
    }

  /* Check if interrupt is from DMA channel 1. */

  intrstat = lpc54_getreg(LPC54_ETH_DMA_INTR_STAT);
  if ((intrstat & ETH_DMA_INTR_STAT_DC1IS) != 0)
    {
      lpc54_eth_channel_work(priv, 1);
    }

  /* Un-lock the network and re-enable Ethernet interrupts */

  net_unlock();
  up_enable_irq(LPC54_IRQ_ETHERNET);
}

/****************************************************************************
 * Name: lpc54_eth_interrupt
 *
 * Description:
 *   Ethernet interrupt handler
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info (architecture-specific)
 *
 * Returned Value:
 *   Runs in the context of a the Ethernet interrupt handler.  Local
 *   interrupts are disabled by the interrupt logic.
 *
 ****************************************************************************/

static int lpc54_eth_interrupt(int irq, void *context, void *arg)
{
  struct lpc54_ethdriver_s *priv = (struct lpc54_ethdriver_s *)arg;

  DEBUGASSERT(priv != NULL);

  /* Disable further Ethernet interrupts.  Because Ethernet interrupts are
   * also disabled if the TX timeout event occurs, there can be no race
   * condition here.
   */

  up_disable_irq(LPC54_IRQ_ETHERNET);

  /* Note:  We have a race condition which, I believe is handled OK.  If
   * there is a Tx timeout in place, then that timeout could expire
   * anytime and queue additional work to handle the timeout.
   */

  /* Schedule to perform the interrupt processing on the worker thread. */

  work_queue(ETHWORK, &priv->eth_irqwork, lpc54_eth_interrupt_work, priv, 0);
  return OK;
}

/****************************************************************************
 * Name: lpc54_pmt_interrupt
 *
 * Description:
 *   Ethernet power management interrupt handler
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info (architecture-specific)
 *
 * Returned Value:
 *   Runs in the context of a the Ethernet PMT interrupt handler.  Local
 *   interrupts are disabled by the interrupt logic.
 *
 ****************************************************************************/

#if 0 /* Not used */
static int  lpc54_pmt_interrupt(int irq, void *context, void *arg)
{
  return OK;
}
#endif

/****************************************************************************
 * Name: lpc54_mac_interrupt
 *
 * Description:
 *   Ethernet MAC interrupt handler
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info (architecture-specific)
 *
 * Returned Value:
 *   Runs in the context of a the Ethernet MAC handler.  Local
 *   interrupts are disabled by the interrupt logic.
 *
 ****************************************************************************/

#if 0 /* Not used */
static int lpc54_mac_interrupt(int irq, void *context, void *arg)
{
  return OK;
}
#endif

/****************************************************************************
 * Name: lpc54_eth_txtimeout_work
 *
 * Description:
 *   Perform TX timeout related work from the worker thread
 *
 * Input Parameters:
 *   arg - The argument passed when work_queue() as called.
 *
 * Returned Value:
 *   OK on success
 *
 * Assumptions:
 *   Runs on a worker thread.
 *
 ****************************************************************************/

static void lpc54_eth_txtimeout_work(void *arg)
{
  struct lpc54_ethdriver_s *priv = (struct lpc54_ethdriver_s *)arg;

