apache/nuttx/arch/arm/src/lpc54xx/lpc54_ethernet.c
  /* Lock the network and serialize driver operations if necessary.
   * NOTE: Serialization is only required in the case where the driver work
   * is performed on an LP worker thread and where more than one LP worker
   * thread has been configured.
   */

  net_lock();

  /* Increment statistics and dump debug info */

  NETDEV_TXTIMEOUTS(&priv->eth_dev);

  /* Then reset the hardware by bringing it down and taking it back up
   * again.
   */

  lpc54_eth_ifdown(&priv->eth_dev);
  lpc54_eth_ifup(&priv->eth_dev);

  /* Then poll the network for new XMIT data */

  lpc54_eth_dopoll(priv);
  net_unlock();
}

/****************************************************************************
 * Name: lpc54_eth_txtimeout_expiry
 *
 * Description:
 *   Our TX watchdog timed out.  Called from the timer interrupt handler.
 *   The last TX never completed.  Reset the hardware and start again.
 *
 * Input Parameters:
 *   arg  - The argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Runs in the context of a the timer interrupt handler.  Local
 *   interrupts are disabled by the interrupt logic.
 *
 ****************************************************************************/

static void lpc54_eth_txtimeout_expiry(wdparm_t arg)
{
  struct lpc54_ethdriver_s *priv = (struct lpc54_ethdriver_s *)arg;

  /* Disable further Ethernet interrupts.  This will prevent some race
   * conditions with interrupt work.  There is still a potential race
   * condition with interrupt work that is already queued and in progress.
   */

  up_disable_irq(LPC54_IRQ_ETHERNET);

  /* Schedule to perform the TX timeout processing on the worker thread. */

  work_queue(ETHWORK, &priv->eth_timeoutwork, lpc54_eth_txtimeout_work,
             priv, 0);
}

/****************************************************************************
 * Name: lpc54_eth_dopoll
 *
 * Description:
 *   Check if there are Tx descriptors available and, if so, allocate a Tx
 *   then perform the normal Tx poll
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static void lpc54_eth_dopoll(struct lpc54_ethdriver_s *priv)
{
  struct lpc54_txring_s *txring0;
#ifdef CONFIG_LPC54_ETH_MULTIQUEUE
  struct lpc54_txring_s *txring1;
#endif

  DEBUGASSERT(priv->eth_dev.d_buf == NULL);

  txring0 = &priv->eth_txring[0];
#ifdef CONFIG_LPC54_ETH_MULTIQUEUE
  txring1 = &priv->eth_txring[1];

  /* We cannot perform the Tx poll now if all of the Tx descriptors for both
   * channels are in-use.
   */

  if (txring0->tr_inuse < txring0->tr_ndesc &&
      txring1->tr_inuse < txring1->tr_ndesc)
#else
  /* We cannot perform the Tx poll now if all of the Tx descriptors for this
   * channel 0 are in-use.
   */

  if (txring0->tr_inuse < txring0->tr_ndesc)
#endif
    {
      /* There is a free descriptor in the ring, allocate a new Tx buffer
       * to perform the poll.
       */

      priv->eth_dev.d_buf = (uint8_t *)lpc54_pktbuf_alloc(priv);
      if (priv->eth_dev.d_buf != NULL)
        {
          devif_poll(&priv->eth_dev, lpc54_eth_txpoll);

          /* Make sure that the Tx buffer remaining after the poll is
           * freed.
           */

          if (priv->eth_dev.d_buf != NULL)
            {
              lpc54_pktbuf_free(priv, (uint32_t *)priv->eth_dev.d_buf);
              priv->eth_dev.d_buf = NULL;
            }
        }
    }
}

/****************************************************************************
 * Name: lpc54_eth_ifup
 *
 * Description:
 *   NuttX Callback: Bring up the Ethernet interface when an IP address is
 *   provided
 *
 * Input Parameters:
 *   dev - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static int lpc54_eth_ifup(struct net_driver_s *dev)
{
  struct lpc54_ethdriver_s *priv =
    (struct lpc54_ethdriver_s *)dev->d_private;
  uint8_t *mptr;
  uintptr_t base;
  uint32_t regval;
  int ret;
  int i;

#ifdef CONFIG_NET_IPv4
  ninfo("Bringing up: %u.%u.%u.%u\n",
        ip4_addr1(dev->d_ipaddr), ip4_addr2(dev->d_ipaddr),
        ip4_addr3(dev->d_ipaddr), ip4_addr4(dev->d_ipaddr));
#endif
#ifdef CONFIG_NET_IPv6
  ninfo("Bringing up: %04x:%04x:%04x:%04x:%04x:%04x:%04x:%04x\n",
        dev->d_ipv6addr[0], dev->d_ipv6addr[1], dev->d_ipv6addr[2],
        dev->d_ipv6addr[3], dev->d_ipv6addr[4], dev->d_ipv6addr[5],
        dev->d_ipv6addr[6], dev->d_ipv6addr[7]);
#endif

  /* Initialize the PHY *****************************************************/

  ret = lpc54_phy_autonegotiate(priv);
  if (ret < 0)
    {
      nerr("ERROR: lpc54_phy_autonegotiate failed: %d\n", ret);
      return ret;
    }

  /* Initialize Ethernet DMA ************************************************/

  /* Reset DMA.  Resets the logic and all internal registers of the OMA, MTL,
   * and MAC.  This bit is automatically cleared after the reset operation
   * is complete in all Ethernet Block clock domains.
   */

  regval  = lpc54_getreg(LPC54_ETH_DMA_MODE);
  regval |= ETH_DMA_MODE_SWR;
  lpc54_putreg(regval, LPC54_ETH_DMA_MODE);

  /* Wait for the reset bit to be cleared at the completion of the reset */

  while ((lpc54_getreg(LPC54_ETH_DMA_MODE) & ETH_DMA_MODE_SWR) != 0)
    {
    }

  /* Set the burst length for each DMA descriptor ring */

  for (i = 0; i < LPC54_NRINGS; i++)
    {
      base = LPC54_ETH_DMACH_BASE(i);
      lpc54_putreg(LPC54_PBLX8, base + LPC54_ETH_DMACH_CTRL_OFFSET);

      regval  = lpc54_getreg(base + LPC54_ETH_DMACH_TX_CTRL_OFFSET);
      regval &= ~ETH_DMACH_TX_CTRL_TXPBL_MASK;
      regval |= ETH_DMACH_TX_CTRL_TXPBL(LPC54_BURSTLEN);
      lpc54_putreg(regval, base + LPC54_ETH_DMACH_TX_CTRL_OFFSET);

      regval  = lpc54_getreg(base + LPC54_ETH_DMACH_RX_CTRL_OFFSET);
      regval &= ~ETH_DMACH_RX_CTRL_RXPBL_MASK;
      regval |= ETH_DMACH_RX_CTRL_RXPBL(LPC54_BURSTLEN);
      lpc54_putreg(regval, base + LPC54_ETH_DMACH_RX_CTRL_OFFSET);
    }

  /* Initializes the Ethernet MTL *******************************************/
#ifdef CONFIG_LPC54_ETH_MULTIQUEUE
  /* Set the schedule/arbitration for multiple queues */

  lpc54_putreg(LPC54_MTL_OPMODE_SCHALG | LPC54_MTL_OPMODE_RAA,
               LPC54_ETH_MTL_OP_MODE);

  /* Set the Rx queue mapping to DMA channel. */

  lpc54_putreg(LPC54_QUEUEMAP, LPC54_ETH_MTL_RXQ_DMA_MAP);
#endif

